[
    {
        "line_start": "0.0",
        "line_end": "8.0",
        "line_text": "Hello, my name is Jeff Messier. I'm a professor in electrical and software engineering in the Schulick School of Engineering at the University of Calgary.\n"
    },
    {
        "line_start": "8.0",
        "line_end": "19.0",
        "line_text": "And this is the introduction to my lecture series on computer organization, computer architecture.\n"
    },
    {
        "line_start": "19.0",
        "line_end": "27.0",
        "line_text": "And so this is a class that I teach at the second year undergraduate engineering level.\n"
    },
    {
        "line_start": "27.0",
        "line_end": "31.0",
        "line_text": "And it's basically where we learn how a computer works.\n"
    },
    {
        "line_start": "31.0",
        "line_end": "35.0",
        "line_text": "Now, most people have some idea of how computers work.\n"
    },
    {
        "line_start": "35.0",
        "line_end": "41.0",
        "line_text": "If you've built your own computer, you know what a CPU is or what RAM does.\n"
    },
    {
        "line_start": "41.0",
        "line_end": "44.0",
        "line_text": "But this is where we really dive into the details.\n"
    },
    {
        "line_start": "44.0",
        "line_end": "56.0",
        "line_text": "We literally pull the top off of the CPU integrated circuit and see exactly how you build a computer from basic logic gates.\n"
    },
    {
        "line_start": "56.0",
        "line_end": "68.0",
        "line_text": "And essentially what this class does is it fills in the gap between knowledge of, you know, basic logic gates and gates or gates flip-flops and software.\n"
    },
    {
        "line_start": "68.0",
        "line_end": "73.0",
        "line_text": "So, at a very low level, you've got transistors, silicon, basic logic gates.\n"
    },
    {
        "line_start": "73.0",
        "line_end": "79.0",
        "line_text": "At a higher level, you've got, you know, programming language like C or Python.\n"
    },
    {
        "line_start": "79.0",
        "line_end": "89.0",
        "line_text": "And we're basically going to fill in the gap. We're going to explain how to create a digital design that can run software.\n"
    },
    {
        "line_start": "89.0",
        "line_end": "95.0",
        "line_text": "And so doing, we will know how a computer works by the end of the course.\n"
    },
    {
        "line_start": "95.0",
        "line_end": "101.0",
        "line_text": "Now, this lecture series is meant to be part of my undergraduate class.\n"
    },
    {
        "line_start": "101.0",
        "line_end": "110.0",
        "line_text": "And if you are just, if you're not in that class and you're just following along on the internet just for, for interest's sake,\n"
    },
    {
        "line_start": "110.0",
        "line_end": "118.0",
        "line_text": "you will find this class most useful if you have at least some understanding of basic digital logic design.\n"
    },
    {
        "line_start": "118.0",
        "line_end": "122.0",
        "line_text": "And by that I mean, and gates, or gates and flip-flops.\n"
    },
    {
        "line_start": "122.0",
        "line_end": "126.0",
        "line_text": "And that's basically where sort of one starting point for the course.\n"
    },
    {
        "line_start": "126.0",
        "line_end": "130.0",
        "line_text": "And also a basic understanding of programming.\n"
    },
    {
        "line_start": "130.0",
        "line_end": "133.0",
        "line_text": "In particular, an understanding of C is, is very helpful.\n"
    },
    {
        "line_start": "133.0",
        "line_end": "140.0",
        "line_text": "So, if you've got those two things, you'll be able to get the most out of this, out of this course.\n"
    },
    {
        "line_start": "140.0",
        "line_end": "146.0",
        "line_text": "So, anyway, let's dive into it and start sort of talking about how we're going to approach this problem.\n"
    },
    {
        "line_start": "146.0",
        "line_end": "151.0",
        "line_text": "So, in some ways, this is a very easy class to teach.\n"
    },
    {
        "line_start": "151.0",
        "line_end": "160.0",
        "line_text": "Because unlike some other electrical engineering courses where you're introducing sort of concepts and things that people aren't familiar with,\n"
    },
    {
        "line_start": "160.0",
        "line_end": "162.0",
        "line_text": "everybody knows what a computer is.\n"
    },
    {
        "line_start": "162.0",
        "line_end": "167.0",
        "line_text": "So, obviously, we use computers everywhere multiple times a day.\n"
    },
    {
        "line_start": "167.0",
        "line_end": "174.0",
        "line_text": "And the experience that most of us have with computers is something I'm going to call the user's perspective.\n"
    },
    {
        "line_start": "174.0",
        "line_end": "180.0",
        "line_text": "And the user's perspective is just simply that, making use of a computer in our daily lives.\n"
    },
    {
        "line_start": "180.0",
        "line_end": "183.0",
        "line_text": "And obviously, this can take many forms.\n"
    },
    {
        "line_start": "183.0",
        "line_end": "193.0",
        "line_text": "So, the original kind of user perspective, at least for the masses, was the personal computer.\n"
    },
    {
        "line_start": "193.0",
        "line_end": "199.0",
        "line_text": "And so, this was started to become more of a normal thing.\n"
    },
    {
        "line_start": "199.0",
        "line_end": "208.0",
        "line_text": "Let's say, kind of late 80s, early 90s, where we, where people started to bring computers into their home.\n"
    },
    {
        "line_start": "208.0",
        "line_end": "210.0",
        "line_text": "And this continues to this day.\n"
    },
    {
        "line_start": "210.0",
        "line_end": "222.0",
        "line_text": "And so, the personal computer or laptop, we have some box, I guess, or some component that we imagine representing the computer.\n"
    },
    {
        "line_start": "222.0",
        "line_end": "227.0",
        "line_text": "With the personal computer, this is sort of like the main computer tower.\n"
    },
    {
        "line_start": "227.0",
        "line_end": "232.0",
        "line_text": "And then we connect a series of things into this computer that allow us to make use of it.\n"
    },
    {
        "line_start": "232.0",
        "line_end": "237.0",
        "line_text": "For example, we will connect a screen into the computer.\n"
    },
    {
        "line_start": "237.0",
        "line_end": "242.0",
        "line_text": "And that allows us to, or that allows the computer to display information for us.\n"
    },
    {
        "line_start": "242.0",
        "line_end": "250.0",
        "line_text": "We connect a keyboard to the computer.\n"
    },
    {
        "line_start": "250.0",
        "line_end": "257.0",
        "line_text": "And that allows us to send input into the computer, send it commands.\n"
    },
    {
        "line_start": "257.0",
        "line_end": "260.0",
        "line_text": "The same thing with a mouse or a trackpad.\n"
    },
    {
        "line_start": "260.0",
        "line_end": "270.0",
        "line_text": "And, you know, we might have probably a set of speakers also connected to the computer.\n"
    },
    {
        "line_start": "270.0",
        "line_end": "275.0",
        "line_text": "And, again, for the sort of the desktop personal computer, these are discrete components.\n"
    },
    {
        "line_start": "275.0",
        "line_end": "281.0",
        "line_text": "For the laptop, these are all sort of integrated into one kind of package.\n"
    },
    {
        "line_start": "281.0",
        "line_end": "286.0",
        "line_text": "But we sort of understand that all these things are connected to something we refer to as a computer.\n"
    },
    {
        "line_start": "286.0",
        "line_end": "288.0",
        "line_text": "And I'll even put that in quotes.\n"
    },
    {
        "line_start": "288.0",
        "line_end": "295.0",
        "line_text": "Another very common way that we interact with computers is using smartphones.\n"
    },
    {
        "line_start": "295.0",
        "line_end": "303.0",
        "line_text": "So, again, inside a smartphone, we understand that there's some kind of device.\n"
    },
    {
        "line_start": "303.0",
        "line_end": "305.0",
        "line_text": "Let's call it a computer.\n"
    },
    {
        "line_start": "305.0",
        "line_end": "312.0",
        "line_text": "And with a smartphone, again, the main way we interact with a smartphone is through a screen.\n"
    },
    {
        "line_start": "312.0",
        "line_end": "322.0",
        "line_text": "Rather than just being an output device, like it is on most personal computers, a screen takes, gives both output to the user, but also accepts input.\n"
    },
    {
        "line_start": "322.0",
        "line_end": "330.0",
        "line_text": "So, all smartphones these days have touch sensitive screens that we can manipulate.\n"
    },
    {
        "line_start": "330.0",
        "line_end": "334.0",
        "line_text": "There's a speaker, again, to get sound out.\n"
    },
    {
        "line_start": "334.0",
        "line_end": "343.0",
        "line_text": "And, there's a microphone to get sound into the computer.\n"
    },
    {
        "line_start": "343.0",
        "line_end": "348.0",
        "line_text": "There's also a camera, which is a big one.\n"
    },
    {
        "line_start": "348.0",
        "line_end": "353.0",
        "line_text": "Another way we interact with computers these days is when we drive a car.\n"
    },
    {
        "line_start": "353.0",
        "line_end": "361.0",
        "line_text": "So, most cars, again, whoops.\n"
    },
    {
        "line_start": "361.0",
        "line_end": "367.0",
        "line_text": "Have something inside them that we would refer to as the computer.\n"
    },
    {
        "line_start": "367.0",
        "line_end": "379.0",
        "line_text": "We then interact with this computer, not directly by typing something into it, like we would with, you know, a personal computer.\n"
    },
    {
        "line_start": "379.0",
        "line_end": "391.0",
        "line_text": "But, this computer would monitor the input from the steering wheel.\n"
    },
    {
        "line_start": "391.0",
        "line_end": "396.0",
        "line_text": "It might monitor input from the pedals.\n"
    },
    {
        "line_start": "396.0",
        "line_end": "404.0",
        "line_text": "And, it would give us information through various display devices.\n"
    },
    {
        "line_start": "404.0",
        "line_end": "412.0",
        "line_text": "These could be the gauges, they could be the kind of flat screen display that you see in most cars these days.\n"
    },
    {
        "line_start": "412.0",
        "line_end": "416.0",
        "line_text": "And, it could be things like warning lights or alarms.\n"
    },
    {
        "line_start": "416.0",
        "line_end": "433.0",
        "line_text": "And, so, one of the things that you would have probably noticed throughout these past three examples is that most of the users perspective, it's kind of focused on something that we call input output or I-O devices.\n"
    },
    {
        "line_start": "433.0",
        "line_end": "440.0",
        "line_text": "Now, I-O devices are basically used by the computer to either receive information from the outside world, which is the input.\n"
    },
    {
        "line_start": "440.0",
        "line_end": "446.0",
        "line_text": "So, it's going into the computer, or to provide information to the outside world throughout the output.\n"
    },
    {
        "line_start": "446.0",
        "line_end": "449.0",
        "line_text": "So, it's coming out of the computer.\n"
    },
    {
        "line_start": "449.0",
        "line_end": "457.0",
        "line_text": "And, so, when we think about it, it's really this I-O interface that the user kind of focuses on.\n"
    },
    {
        "line_start": "457.0",
        "line_end": "464.0",
        "line_text": "This is where we sort of- this is where the plane of interaction is with our computer.\n"
    },
    {
        "line_start": "464.0",
        "line_end": "467.0",
        "line_text": "But, that's really where the understanding for most people stop.\n"
    },
    {
        "line_start": "467.0",
        "line_end": "474.0",
        "line_text": "So, we know that there is a quote unquote computer inside these things, but we don't really know how that computer works.\n"
    },
    {
        "line_start": "474.0",
        "line_end": "478.0",
        "line_text": "But, that's basically what we're going to be talking about in this class.\n"
    },
    {
        "line_start": "478.0",
        "line_end": "486.0",
        "line_text": "So, the purpose of this class is to really understand what goes on inside this kind of quote unquote computer box.\n"
    },
    {
        "line_start": "486.0",
        "line_end": "495.0",
        "line_text": "And, we're going to be talking about sort of the- the marriage or the interaction of two devices or two sort of concepts.\n"
    },
    {
        "line_start": "495.0",
        "line_end": "498.0",
        "line_text": "One is the concept of the computer hardware.\n"
    },
    {
        "line_start": "498.0",
        "line_end": "500.5",
        "line_text": "This is the physical construction of a computer.\n"
    },
    {
        "line_start": "500.5",
        "line_end": "506.5",
        "line_text": "So, we're going to be diving deep into the- into this kind of computer box.\n"
    },
    {
        "line_start": "506.5",
        "line_end": "515.5",
        "line_text": "We're going to rip off the lid and we're going to look at how you literally build a computer using very basic fundamental digital logic gates.\n"
    },
    {
        "line_start": "515.5",
        "line_end": "528.5",
        "line_text": "However, you can't understand how a computer is designed from a hardware point of view with also understanding how software runs on a computer at a very low level.\n"
    },
    {
        "line_start": "528.5",
        "line_end": "532.5",
        "line_text": "And so, it's impossible to sort of separate the concepts of hardware and software.\n"
    },
    {
        "line_start": "532.5",
        "line_end": "534.5",
        "line_text": "You have to talk about both together.\n"
    },
    {
        "line_start": "534.5",
        "line_end": "537.5",
        "line_text": "And that's going to be one theme for this- this lecture series.\n"
    },
    {
        "line_start": "537.5",
        "line_end": "544.5",
        "line_text": "And so, for now, we'll refer to software as the programs or apps that we run on the computer that basically define its behavior.\n"
    },
    {
        "line_start": "544.5",
        "line_end": "550.5",
        "line_text": "And so, the nice thing about computers is that we can use them for lots of different things.\n"
    },
    {
        "line_start": "550.5",
        "line_end": "557.5",
        "line_text": "So, your smartphone has a whole bunch of apps that allow you to use it to play games or visit with a friend or watch a movie.\n"
    },
    {
        "line_start": "557.5",
        "line_end": "572.5",
        "line_text": "And it's the concept of having a bunch of different programs that we can run on basically a common hardware platform that is one of the really powerful things about what we're going to be talking about in this course.\n"
    },
    {
        "line_start": "572.5",
        "line_end": "581.5",
        "line_text": "The next perspective that many of you will also have regarding using a computer is the programmer's perspective.\n"
    },
    {
        "line_start": "581.5",
        "line_end": "594.5",
        "line_text": "And if you are watching this lecture series or taking the course that I'm teaching, it's probably because you are in an engineering program or maybe a computer science program.\n"
    },
    {
        "line_start": "594.5",
        "line_end": "601.5",
        "line_text": "And you have already likely gone through some sort of introductory courses, maybe in your first year, where you've learned how to program.\n"
    },
    {
        "line_start": "601.5",
        "line_end": "604.5",
        "line_text": "And many of you will have known how to program long before you came to university.\n"
    },
    {
        "line_start": "604.5",
        "line_end": "612.5",
        "line_text": "So, it's very common now for kids to grow up going to programming camps and start to learn how to program really at a very young age.\n"
    },
    {
        "line_start": "612.5",
        "line_end": "618.5",
        "line_text": "And the programmer's perspective is essentially using a computer to develop software.\n"
    },
    {
        "line_start": "618.5",
        "line_end": "623.5",
        "line_text": "And this is typically in what we are going to refer to as a high level language.\n"
    },
    {
        "line_start": "623.5",
        "line_end": "630.5",
        "line_text": "And so some common high level languages are C, Python is something that most people are a lot of people are familiar with.\n"
    },
    {
        "line_start": "630.5",
        "line_end": "633.5",
        "line_text": "JavaScript, Java.\n"
    },
    {
        "line_start": "633.5",
        "line_end": "644.5",
        "line_text": "These are the languages that you sort of type into a computer in a fairly high level interface and it generates a program that does something for you.\n"
    },
    {
        "line_start": "644.5",
        "line_end": "649.5",
        "line_text": "Often a video game or perhaps a web server or web service.\n"
    },
    {
        "line_start": "649.5",
        "line_end": "664.5",
        "line_text": "And basically software development is done in some kind of programming environment that takes the code that you write, the actual commands that you write in Python or C and translates that into a working program.\n"
    },
    {
        "line_start": "664.5",
        "line_end": "679.5",
        "line_text": "And, you know, for many forms of software development, maybe in your own personal experience up until now, you know, you've been able to probably develop a lot of software without really understanding how a computer does what it does.\n"
    },
    {
        "line_start": "679.5",
        "line_end": "689.5",
        "line_text": "You know, you can particularly if you're programming like a game, for example, you can type in a bunch of commands to make your video game, do a certain thing and it'll run on your computer.\n"
    },
    {
        "line_start": "689.5",
        "line_end": "704.5",
        "line_text": "And as long as you aren't pushing your computer too hard or doing very high end graphics, you can sort of type in your commands and just let the game render on your screen without worrying about too much about what's going on under the hood.\n"
    },
    {
        "line_start": "704.5",
        "line_end": "710.5",
        "line_text": "Another perspective we can take on a computer is something I'm going to refer to as the silicon perspective.\n"
    },
    {
        "line_start": "710.5",
        "line_end": "722.5",
        "line_text": "And most people have heard of the idea that computers are implemented using very small devices that are created on chips made of silicon.\n"
    },
    {
        "line_start": "722.5",
        "line_end": "729.5",
        "line_text": "And of course, these devices are transistors and maybe you've even seen pictures that look like this.\n"
    },
    {
        "line_start": "729.5",
        "line_end": "732.5",
        "line_text": "This is a picture of what's known as a wafer.\n"
    },
    {
        "line_start": "732.5",
        "line_end": "751.5",
        "line_text": "And on a wafer, there are a number of microchips created in rows and these wafers are chopped up into square pieces and the chips are put into packages and then put on circuit boards to create computers and other digital devices.\n"
    },
    {
        "line_start": "751.5",
        "line_end": "760.5",
        "line_text": "And so we talk about how computers are made up of billions and billions of transistors.\n"
    },
    {
        "line_start": "760.5",
        "line_end": "774.5",
        "line_text": "So for example, the Apple A13 processor contains 8.5 billion transistors, just a massive number and each transistor is only seven nanometers wide, which is the width of 14 atoms.\n"
    },
    {
        "line_start": "774.5",
        "line_end": "793.5",
        "line_text": "So if you're kind of a computer enthusiast or you've listened to people talk about computers, you may have received this perspective as well, this sort of abstract notion that we make computers out of billions of tiny transistors on silicon and the transistors are ridiculously small.\n"
    },
    {
        "line_start": "793.5",
        "line_end": "807.5",
        "line_text": "And this is typically when people sort of speak of computers in this way, it's also still very abstract like we can kind of appreciate these general concepts, but it doesn't really help us understand how computers actually work.\n"
    },
    {
        "line_start": "807.5",
        "line_end": "818.5",
        "line_text": "And so the fun thing about teaching this course is this is really where I get to help you bridge that gap.\n"
    },
    {
        "line_start": "818.5",
        "line_end": "832.5",
        "line_text": "So once you're done taking this class, you will be able to bridge the gap between the programmers perspective, which is a very high level perspective, you know, you're typing something in Python and maybe you're playing a game.\n"
    },
    {
        "line_start": "832.5",
        "line_end": "846.5",
        "line_text": "And you'll be able to understand how we can go from that perspective all the way down to this idea of, you know, transistors created billions of tiny transistors created on a silicon chip.\n"
    },
    {
        "line_start": "846.5",
        "line_end": "853.5",
        "line_text": "So you've already most likely in your program started to bridge this gap already.\n"
    },
    {
        "line_start": "853.5",
        "line_end": "868.5",
        "line_text": "So this class assumes that you've taken some sort of basic digital logic class where you've talked about the idea of basic logic gates, not gates and gates or gates and so on.\n"
    },
    {
        "line_start": "868.5",
        "line_end": "875.5",
        "line_text": "And you would have talked about how individual transistors can be used to create these basic logic functions.\n"
    },
    {
        "line_start": "875.5",
        "line_end": "886.5",
        "line_text": "Most likely you've also talked a little bit about how to create circuits with memory, for example, using flip flops that can store and remember a certain state.\n"
    },
    {
        "line_start": "886.5",
        "line_end": "901.5",
        "line_text": "And you would have seen how to design how to sort of assemble flip flops to create what are known as state machines that change their digital state based on input from from the user or the outside environment.\n"
    },
    {
        "line_start": "901.5",
        "line_end": "930.5",
        "line_text": "And, you know, I suppose once you've done, once you're done taking a class like that, you can kind of appreciate how this could be, you know, how these concepts could be sort of a computer, but it would still be in very heavy quotation marks because, you know, it's kind of hard to go from, you know, an eight state, state machine using D flip flops all the way up to, you know, somebody writing a program in Python.\n"
    },
    {
        "line_start": "930.5",
        "line_end": "949.5",
        "line_text": "And so again, the purpose of this class is really to help sort of start from this digital logic gate understanding and create a structure that can run software that can really be written to perform any sequence of commands that the programmer wants.\n"
    },
    {
        "line_start": "950.5",
        "line_end": "968.5",
        "line_text": "Okay, so now I'd like to talk about a new or different computer perspective and that's the micro architecture perspective and this is the perspective actually that we're going to be introducing and working with in this course and it is will likely be new to most of you.\n"
    },
    {
        "line_start": "968.5",
        "line_end": "979.5",
        "line_text": "So, first of all, a micro architecture is basically refers to the digital blocks that we implement in silicon to build a computer.\n"
    },
    {
        "line_start": "979.5",
        "line_end": "984.5",
        "line_text": "So, these are the digital blocks that we're going to put together that we'll be able to run software.\n"
    },
    {
        "line_start": "984.5",
        "line_end": "1007.5",
        "line_text": "And a micro architecture as we're going to see executes a series of low level instructions called machine language instructions and part of what we're going to be talking about in future modules is also how a high level language like Python or C gets translated into these low level machine language instructions.\n"
    },
    {
        "line_start": "1007.5",
        "line_end": "1024.5",
        "line_text": "And when we talk about instructions set architecture, basically the instructions that architecture are all the different machine language instructions that can be run on a particular micro architecture.\n"
    },
    {
        "line_start": "1025.5",
        "line_end": "1046.5",
        "line_text": "When you create a micro architecture, you simultaneously also create a library of commands or a group of machine language commands that can run on that micro architecture and different micro architectures will have a different set of commands that they can run.\n"
    },
    {
        "line_start": "1046.5",
        "line_end": "1054.5",
        "line_text": "And so, when we talk about instructions at architecture, sometimes we just refer to that as architecture for short.\n"
    },
    {
        "line_start": "1054.5",
        "line_end": "1063.5",
        "line_text": "And architecture is also a word that we use to refer to different families of processor or different families of micro architecture.\n"
    },
    {
        "line_start": "1063.5",
        "line_end": "1079.5",
        "line_text": "And so, some of the very common examples that you would have most likely heard of are the x86 family of micro architecture or architecture family.\n"
    },
    {
        "line_start": "1079.5",
        "line_end": "1091.5",
        "line_text": "And this was, this architecture was originally developed by Intel and it makes up most of the processors that we use today on PCs and laptops.\n"
    },
    {
        "line_start": "1091.5",
        "line_end": "1095.5",
        "line_text": "So this includes the i5 and i7 family of processors.\n"
    },
    {
        "line_start": "1095.5",
        "line_end": "1102.5",
        "line_text": "And you'll notice that I'm using the term processor and micro architecture kind of interchangeably.\n"
    },
    {
        "line_start": "1102.5",
        "line_end": "1112.5",
        "line_text": "So a processor is another word that we sometimes use to refer to, again, the digital blocks that exist on a silicon chip that can run software.\n"
    },
    {
        "line_start": "1112.5",
        "line_end": "1120.5",
        "line_text": "Another processor family that's very important is the advanced risk machine or arm architecture.\n"
    },
    {
        "line_start": "1120.5",
        "line_end": "1126.5",
        "line_text": "And arms are the most widely used architecture in the world to date by some estimates.\n"
    },
    {
        "line_start": "1126.5",
        "line_end": "1130.5",
        "line_text": "They're used now in personal computers.\n"
    },
    {
        "line_start": "1130.5",
        "line_end": "1135.5",
        "line_text": "So, for example, the new Apple laptops are based on an arm architecture.\n"
    },
    {
        "line_start": "1135.5",
        "line_end": "1139.5",
        "line_text": "They're also very commonly used in smartphones.\n"
    },
    {
        "line_start": "1139.5",
        "line_end": "1151.5",
        "line_text": "And finally, another architecture example is AVR, which, you know, there's no official sort of definition for what AVR stands for.\n"
    },
    {
        "line_start": "1151.5",
        "line_end": "1157.5",
        "line_text": "But it's commonly accepted to stand for alpha and vergards reduced instruction set computer.\n"
    },
    {
        "line_start": "1157.5",
        "line_end": "1172.5",
        "line_text": "Basically, the AVR is a little microcontroller that we are going to be working with in this class to get some hands-on experience with working with low level, a low level computer design.\n"
    },
    {
        "line_start": "1172.5",
        "line_end": "1184.5",
        "line_text": "And the AVR architecture is what we're going to actually be using throughout this lecture series as an example architecture as we build up our micro architecture from scratch.\n"
    },
    {
        "line_start": "1184.5",
        "line_end": "1193.5",
        "line_text": "The AVR family of chips are most commonly known as the microcontroller family that are used by Arduino.\n"
    },
    {
        "line_start": "1193.5",
        "line_end": "1200.5",
        "line_text": "So if you've used an Arduino, you've used a microcontroller from the AVR family.\n"
    },
    {
        "line_start": "1200.5",
        "line_end": "1204.5",
        "line_text": "And so let's dive into micro architecture design.\n"
    },
    {
        "line_start": "1204.5",
        "line_end": "1216.5",
        "line_text": "So I'm going to start by writing or drawing an extremely high-level picture of a micro architecture.\n"
    },
    {
        "line_start": "1216.5",
        "line_end": "1223.5",
        "line_text": "Our micro architecture is going to have what I'm going to refer to as a processor.\n"
    },
    {
        "line_start": "1223.5",
        "line_end": "1228.5",
        "line_text": "This is the brain, if you like, of our micro architecture.\n"
    },
    {
        "line_start": "1228.5",
        "line_end": "1235.5",
        "line_text": "This is where the calculations are done and where decisions are made.\n"
    },
    {
        "line_start": "1235.5",
        "line_end": "1252.5",
        "line_text": "We also need to be able to store our program that we want to run on the processor as well as be able to store some of the intermediate or final values that are generated by the processor's calculations.\n"
    },
    {
        "line_start": "1252.5",
        "line_end": "1254.5",
        "line_text": "And we're going to do that with memory.\n"
    },
    {
        "line_start": "1254.5",
        "line_end": "1259.5",
        "line_text": "And memory again is a very familiar idea for people who work with computers.\n"
    },
    {
        "line_start": "1259.5",
        "line_end": "1268.5",
        "line_text": "Of course, the hard drive on your computer is a form of memory, RAM inside your computer is a form of memory as well.\n"
    },
    {
        "line_start": "1268.5",
        "line_end": "1281.5",
        "line_text": "And we're going to connect for now the memory on the processor together with just a bi-directional arrow indicating that information flows from memory to the processor and back in the other direction.\n"
    },
    {
        "line_start": "1281.5",
        "line_end": "1286.5",
        "line_text": "And this connection I'm going to refer to as a bus.\n"
    },
    {
        "line_start": "1286.5",
        "line_end": "1296.5",
        "line_text": "And so a bus refers to the electrical connections that exist between the components of our micro architecture.\n"
    },
    {
        "line_start": "1296.5",
        "line_end": "1302.5",
        "line_text": "And these electrical connections, you know, sometimes we even refer to them as wires.\n"
    },
    {
        "line_start": "1302.5",
        "line_end": "1316.5",
        "line_text": "But in reality, they are little incredibly thin strips of metal that are laid down on the silicon chip where we're implementing the rest of our micro architecture.\n"
    },
    {
        "line_start": "1316.5",
        "line_end": "1324.5",
        "line_text": "And finally, the last high level block is our\n"
    },
    {
        "line_start": "1325.5",
        "line_end": "1328.5",
        "line_text": "input-output devices or our IO devices.\n"
    },
    {
        "line_start": "1328.5",
        "line_end": "1333.5",
        "line_text": "This is how our computer interacts with the rest of the world.\n"
    },
    {
        "line_start": "1333.5",
        "line_end": "1335.5",
        "line_text": "It accepts input from the world.\n"
    },
    {
        "line_start": "1335.5",
        "line_end": "1339.5",
        "line_text": "Maybe we're talking about a keyboard or a mouse.\n"
    },
    {
        "line_start": "1339.5",
        "line_end": "1351.5",
        "line_text": "This could also be, you know, a sensor perhaps that maybe a little micro controller is sampling as part of an Internet of Things application.\n"
    },
    {
        "line_start": "1351.5",
        "line_end": "1355.5",
        "line_text": "And output devices, of course, can be the screens of our computer.\n"
    },
    {
        "line_start": "1355.5",
        "line_end": "1369.5",
        "line_text": "But they could also be things like a flashing LED to indicate an alarm condition or a motor, a servo motor that moves in response to some sort of condition.\n"
    },
    {
        "line_start": "1369.5",
        "line_end": "1376.5",
        "line_text": "And so with this, you know, high level discussion, we've defined already a number of terms.\n"
    },
    {
        "line_start": "1376.5",
        "line_end": "1383.5",
        "line_text": "So first of all, processor is the act of block of the computer that's responsible for following the instructions that make up a program.\n"
    },
    {
        "line_start": "1383.5",
        "line_end": "1392.5",
        "line_text": "So a program is basically just a series of instructions and the processor implements or executes those instructions.\n"
    },
    {
        "line_start": "1392.5",
        "line_end": "1397.5",
        "line_text": "Memory is where programs and data are stored.\n"
    },
    {
        "line_start": "1397.5",
        "line_end": "1405.5",
        "line_text": "IO, we've already defined as any interface or device used to send information into the computer or to get information out of the computer.\n"
    },
    {
        "line_start": "1405.5",
        "line_end": "1416.5",
        "line_text": "The bus consists of one or more wires that can run in parallel and carry information between our micro architecture components.\n"
    },
    {
        "line_start": "1416.5",
        "line_end": "1424.5",
        "line_text": "Again, the buses are sometimes literally external connections consisting of actual wires.\n"
    },
    {
        "line_start": "1424.5",
        "line_end": "1435.5",
        "line_text": "But most of the buses we talk about in this class will be implemented using just very narrow traces of metal laid down on the silicon chip itself.\n"
    },
    {
        "line_start": "1435.5",
        "line_end": "1446.5",
        "line_text": "Microprocessors, and you're going to hear me sometimes use the term microprocessor and sometimes the term microcontroller.\n"
    },
    {
        "line_start": "1446.5",
        "line_end": "1456.5",
        "line_text": "And these are kind of squishy definitions. I mean, you'll hear people sort of throw these words around to refer to like a variety of different things.\n"
    },
    {
        "line_start": "1456.5",
        "line_end": "1472.5",
        "line_text": "But in this course, the distinction we're going to make is a microprocessor is a chip that is supported by several other external chips when used as part of a computer.\n"
    },
    {
        "line_start": "1472.5",
        "line_end": "1488.5",
        "line_text": "So a microprocessor, for example, might contain just the processor block of our micro architecture and then perhaps the memory blocks are located within external devices.\n"
    },
    {
        "line_start": "1488.5",
        "line_end": "1497.5",
        "line_text": "And so a great example of this again is the personal computer where you've got your CPU, which we would refer to as our microprocessor.\n"
    },
    {
        "line_start": "1497.5",
        "line_end": "1509.5",
        "line_text": "It might have a little bit of memory inside it, but also the RAM would be an external chip that plugs into your motherboard and the hard drive would be an external device that also plugs into your motherboard.\n"
    },
    {
        "line_start": "1509.5",
        "line_end": "1526.5",
        "line_text": "In contrast, a microcontroller you can think of as basically a one chip computer. So it's a single integrated circuit that contains the processor, the memory, the IO devices, everything you need all contained in one little chip.\n"
    },
    {
        "line_start": "1526.5",
        "line_end": "1536.5",
        "line_text": "And the microcontroller that we're going to be focusing on in this class is one of the AVR microcontrollers.\n"
    },
    {
        "line_start": "1536.5",
        "line_end": "1555.5",
        "line_text": "And we're going to be using it both for our hands-on work in the labs of this course, but also we're going to basically build that sort of the internals of that AVR microcontroller as we move through the different modules of this course.\n"
    },
    {
        "line_start": "1555.5",
        "line_end": "1567.5",
        "line_text": "And just to expand a little bit more on the idea of buses, so buses are digital connections between the functional blocks of our micro architecture.\n"
    },
    {
        "line_start": "1567.5",
        "line_end": "1576.5",
        "line_text": "And we refer to buses as sometimes being serial buses and sometimes being parallel buses.\n"
    },
    {
        "line_start": "1576.5",
        "line_end": "1585.5",
        "line_text": "And for a serial bus, one bit of information is transmitted at a time over a single wire.\n"
    },
    {
        "line_start": "1585.5",
        "line_end": "1592.5",
        "line_text": "So if we're sending a byte of information, we transmit each bit one at a time over a single wire.\n"
    },
    {
        "line_start": "1592.5",
        "line_end": "1607.5",
        "line_text": "Now, often people will think of a serial bus as consisting of just a single wire, but usually there's other wires in parallel with that wire that help carry things like clock or control signals.\n"
    },
    {
        "line_start": "1607.5",
        "line_end": "1624.5",
        "line_text": "And so most serial buses will consist of a single wire for carrying serial data, plus another wire perhaps for a clock, plus maybe one or two more wires for control information.\n"
    },
    {
        "line_start": "1624.5",
        "line_end": "1638.5",
        "line_text": "So a parallel bus consists of several parallel wires that carry several bits in parallel several different bits in parallel simultaneously.\n"
    },
    {
        "line_start": "1638.5",
        "line_end": "1650.5",
        "line_text": "So yeah, so parallel bus carries several is one that carries several bits in parallel, and so you can send a bunch of bits simultaneously and usually implemented using several parallel wires.\n"
    },
    {
        "line_start": "1650.5",
        "line_end": "1670.5",
        "line_text": "When I'm drawing a parallel bus in the diagrams in this class, I suppose one way I could do it is if we had an eight bit parallel bus, I could draw one, two, three, four, five, six, seven, eight individual wires, but that gets pretty clumsy.\n"
    },
    {
        "line_start": "1670.5",
        "line_end": "1687.5",
        "line_text": "So what I'm going to do instead is I'm going to draw a thick wire and then to indicate how many parallel wires make up the bus, I'll just do a slash and then I'll write a number indicating that this is an eight bit parallel bus.\n"
    },
    {
        "line_start": "1687.5",
        "line_end": "1695.5",
        "line_text": "A single digital line I'm going to draw with a slightly thinner line.\n"
    },
    {
        "line_start": "1695.5",
        "line_end": "1704.5",
        "line_text": "So what I want to do is now talk a little bit more about the AVR micro architecture that we are going to be focusing on in this class.\n"
    },
    {
        "line_start": "1704.5",
        "line_end": "1717.5",
        "line_text": "And the AVR chip that we're going to be working with is what's known as a Harvard micro architecture and a Harvard micro architecture separates instruction memory from data memory.\n"
    },
    {
        "line_start": "1717.5",
        "line_end": "1723.5",
        "line_text": "And so instruction memory is where our program is stored.\n"
    },
    {
        "line_start": "1723.5",
        "line_end": "1734.5",
        "line_text": "As the name suggests, this is the series of machine language instructions generated from our program that are fed into the processor and executed by the processor.\n"
    },
    {
        "line_start": "1734.5",
        "line_end": "1740.5",
        "line_text": "Separate from instruction memory is a second memory block that we're going to refer to as data memory.\n"
    },
    {
        "line_start": "1740.5",
        "line_end": "1743.5",
        "line_text": "Data memory is basically for storing variables.\n"
    },
    {
        "line_start": "1743.5",
        "line_end": "1754.5",
        "line_text": "So if you're doing calculations and you need to store intermediate values and variables, that's what is done in the data memory.\n"
    },
    {
        "line_start": "1754.5",
        "line_end": "1762.5",
        "line_text": "And finally, we have one more block for our IO devices.\n"
    },
    {
        "line_start": "1762.5",
        "line_end": "1770.5",
        "line_text": "Here's the functional block diagram of the AVR 128 DB 28 micro controller.\n"
    },
    {
        "line_start": "1770.5",
        "line_end": "1776.5",
        "line_text": "This is microprocessor, but really it should be micro controller because this is a one chip computer.\n"
    },
    {
        "line_start": "1776.5",
        "line_end": "1783.5",
        "line_text": "You give 3.3 volts to this chip and it has everything inside it to completely run a program.\n"
    },
    {
        "line_start": "1783.5",
        "line_end": "1797.5",
        "line_text": "And so I'm not at this point going to dive into what all of these blocks are necessarily other than to point out the big sort of pieces or functional components.\n"
    },
    {
        "line_start": "1797.5",
        "line_end": "1801.5",
        "line_text": "So up here we have the CPU.\n"
    },
    {
        "line_start": "1801.5",
        "line_end": "1804.5",
        "line_text": "This is basically our processor block.\n"
    },
    {
        "line_start": "1804.5",
        "line_end": "1808.5",
        "line_text": "Over here we have our flash memory.\n"
    },
    {
        "line_start": "1808.5",
        "line_end": "1811.5",
        "line_text": "That's basically our instruction memory.\n"
    },
    {
        "line_start": "1811.5",
        "line_end": "1814.5",
        "line_text": "We've got some SRAM over here.\n"
    },
    {
        "line_start": "1814.5",
        "line_end": "1815.5",
        "line_text": "That's our data memory.\n"
    },
    {
        "line_start": "1815.5",
        "line_end": "1821.5",
        "line_text": "And then we have a whole bunch of IO devices.\n"
    },
    {
        "line_start": "1821.5",
        "line_end": "1828.5",
        "line_text": "Now, IO for a microcontroller like this is a little different than IO for a laptop.\n"
    },
    {
        "line_start": "1828.5",
        "line_end": "1835.5",
        "line_text": "So you're not going to see an HDMI port for a screen on a simple device like this.\n"
    },
    {
        "line_start": "1835.5",
        "line_end": "1839.5",
        "line_text": "You're not going to see a USB port for a keyboard.\n"
    },
    {
        "line_start": "1839.5",
        "line_end": "1847.5",
        "line_text": "But instead we have things like analog to digital converters, digital to analog converters.\n"
    },
    {
        "line_start": "1847.5",
        "line_end": "1851.5",
        "line_text": "We have a series of timers.\n"
    },
    {
        "line_start": "1851.5",
        "line_end": "1856.5",
        "line_text": "We have a UART for sending serial information.\n"
    },
    {
        "line_start": "1856.5",
        "line_end": "1863.5",
        "line_text": "We have two other kinds of serial buses.\n"
    },
    {
        "line_start": "1863.5",
        "line_end": "1867.5",
        "line_text": "And we have some onboard opamps.\n"
    },
    {
        "line_start": "1867.5",
        "line_end": "1871.5",
        "line_text": "And we also have a whole bunch of general purpose digital IO.\n"
    },
    {
        "line_start": "1871.5",
        "line_end": "1876.5",
        "line_text": "And so this is how we're going to be using these chips to interact with the real world.\n"
    },
    {
        "line_start": "1876.5",
        "line_end": "1880.5",
        "line_text": "And so we're going to be diving into this microcontroller and getting to know it in two ways.\n"
    },
    {
        "line_start": "1880.5",
        "line_end": "1886.5",
        "line_text": "In our hands-on exercises, we're going to be using this as part of a design.\n"
    },
    {
        "line_start": "1886.5",
        "line_end": "1887.5",
        "line_text": "You're going to get one of these chips.\n"
    },
    {
        "line_start": "1887.5",
        "line_end": "1889.5",
        "line_text": "You're going to pop it down on a breadboard.\n"
    },
    {
        "line_start": "1889.5",
        "line_end": "1893.5",
        "line_text": "And we're going to be using it to play music.\n"
    },
    {
        "line_start": "1893.5",
        "line_end": "1896.5",
        "line_text": "We're going to be using it to control a servo motor.\n"
    },
    {
        "line_start": "1896.5",
        "line_end": "1899.5",
        "line_text": "We're going to be using it to read switches.\n"
    },
    {
        "line_start": "1899.5",
        "line_end": "1909.5",
        "line_text": "And so with our hands-on exercises, we're going to get to know the input output capabilities of this device.\n"
    },
    {
        "line_start": "1909.5",
        "line_end": "1917.5",
        "line_text": "In the theoretical part of the course where we talk about the theory of micro architecture design,\n"
    },
    {
        "line_start": "1917.5",
        "line_end": "1928.5",
        "line_text": "we are basically going to build these three blocks from basic digital logic gates and flip-flops.\n"
    },
    {
        "line_start": "1928.5",
        "line_end": "1934.5",
        "line_text": "So we're going to build this a design for this chip, sort of from the inside out.\n"
    },
    {
        "line_start": "1934.5",
        "line_end": "1940.5",
        "line_text": "And then we're going to use the finished design in actual hands-on circuits.\n"
    },
    {
        "line_start": "1940.5",
        "line_end": "1946.5",
        "line_text": "So I'd like to finish up this intro module by talking about a few more kind of high-level concepts\n"
    },
    {
        "line_start": "1946.5",
        "line_end": "1953.5",
        "line_text": "and some terminology to better put what we're going to be talking about into context.\n"
    },
    {
        "line_start": "1953.5",
        "line_end": "1959.5",
        "line_text": "The first thing I want to talk about is this notion of specialized versus generalized computing.\n"
    },
    {
        "line_start": "1959.5",
        "line_end": "1969.5",
        "line_text": "So typically, we say that a microprocessor or microcontroller or micro architecture is an example of generalized computing.\n"
    },
    {
        "line_start": "1969.5",
        "line_end": "1971.5",
        "line_text": "What do we mean by that?\n"
    },
    {
        "line_start": "1971.5",
        "line_end": "1975.5",
        "line_text": "Basically, a micro architecture is a digital design.\n"
    },
    {
        "line_start": "1975.5",
        "line_end": "1979.5",
        "line_text": "So it's built up of AND gates or gates flip-flops.\n"
    },
    {
        "line_start": "1979.5",
        "line_end": "1985.5",
        "line_text": "But what you make it do can be changed not by changing the silicon itself,\n"
    },
    {
        "line_start": "1985.5",
        "line_end": "1991.5",
        "line_text": "but by changing the program that you load into the instruction memory of your device.\n"
    },
    {
        "line_start": "1991.5",
        "line_end": "1998.5",
        "line_text": "And so the actions taken by the processor depend on the instruction stored in memory.\n"
    },
    {
        "line_start": "1998.5",
        "line_end": "2003.5",
        "line_text": "And this is something that's known as the stored program concept.\n"
    },
    {
        "line_start": "2003.5",
        "line_end": "2012.5",
        "line_text": "So what your processor actually does depends on the program that you have, that it's storing.\n"
    },
    {
        "line_start": "2012.5",
        "line_end": "2018.5",
        "line_text": "And this almost seems like an obvious statement.\n"
    },
    {
        "line_start": "2018.5",
        "line_end": "2020.5",
        "line_text": "It's like a wall of course.\n"
    },
    {
        "line_start": "2020.5",
        "line_end": "2023.5",
        "line_text": "You program a computer to do something different and it does something different.\n"
    },
    {
        "line_start": "2023.5",
        "line_end": "2026.5",
        "line_text": "But not all digital designs are like this.\n"
    },
    {
        "line_start": "2026.5",
        "line_end": "2032.5",
        "line_text": "And so some digital circuits are designed to do only one job.\n"
    },
    {
        "line_start": "2032.5",
        "line_end": "2039.5",
        "line_text": "And these are specialized digital designs that do things like, for example,\n"
    },
    {
        "line_start": "2039.5",
        "line_end": "2047.5",
        "line_text": "the chip that takes information and transmits it over an Ethernet port, for example.\n"
    },
    {
        "line_start": "2047.5",
        "line_end": "2053.5",
        "line_text": "Or the chip that receives Wi-Fi signals and decodes the Wi-Fi signals.\n"
    },
    {
        "line_start": "2053.5",
        "line_end": "2056.5",
        "line_text": "Those are designs that can do only one thing.\n"
    },
    {
        "line_start": "2056.5",
        "line_end": "2061.5",
        "line_text": "So you can't, for example, reprogram a Wi-Fi chip to play a game.\n"
    },
    {
        "line_start": "2061.5",
        "line_end": "2066.5",
        "line_text": "It contains a whole bunch of digital structures that have some flexibility,\n"
    },
    {
        "line_start": "2066.5",
        "line_end": "2069.5",
        "line_text": "but basically they're designed to do only one thing.\n"
    },
    {
        "line_start": "2069.5",
        "line_end": "2075.5",
        "line_text": "Specialized circuits tend to be implemented first on field programmable gate arrays or FPGAs.\n"
    },
    {
        "line_start": "2075.5",
        "line_end": "2080.5",
        "line_text": "This is something that you'll be learning about later on in our program in a different class.\n"
    },
    {
        "line_start": "2080.5",
        "line_end": "2086.5",
        "line_text": "And once you have this design sort of implemented and tested on an FPGA,\n"
    },
    {
        "line_start": "2086.5",
        "line_end": "2091.5",
        "line_text": "it's usually migrated to something called an application specific integrated circuit or ASIC.\n"
    },
    {
        "line_start": "2091.5",
        "line_end": "2101.5",
        "line_text": "And this is just a whole bunch of chips that are stamped out with very specialized static digital designs on them.\n"
    },
    {
        "line_start": "2101.5",
        "line_end": "2110.5",
        "line_text": "These kinds of ASICs are very fast, they're very cheap, and they're very power efficient.\n"
    },
    {
        "line_start": "2110.5",
        "line_end": "2113.5",
        "line_text": "However, they are not very versatile.\n"
    },
    {
        "line_start": "2113.5",
        "line_end": "2121.5",
        "line_text": "Again, once you build a chip to decode Wi-Fi signals, that chip can basically only do one thing.\n"
    },
    {
        "line_start": "2121.5",
        "line_end": "2130.5",
        "line_text": "So there are some examples of devices that incorporate ideas from both generalized and specialized computing.\n"
    },
    {
        "line_start": "2130.5",
        "line_end": "2140.5",
        "line_text": "A great example is the graphical processing unit or GPU devices or chips.\n"
    },
    {
        "line_start": "2140.5",
        "line_end": "2152.5",
        "line_text": "So GPUs, most people know, are the specialized high-speed chips that exist inside video cards in order to accelerate the rendering of graphics, particularly for games.\n"
    },
    {
        "line_start": "2152.5",
        "line_end": "2165.5",
        "line_text": "And if you look at the design of a GPU, it consists of a whole bunch of parallel processors connected to high-speed memory that are basically designed to do a good job of rendering polygons,\n"
    },
    {
        "line_start": "2165.5",
        "line_end": "2170.5",
        "line_text": "because most sort of 3D-type-looking games are created from polygons.\n"
    },
    {
        "line_start": "2170.5",
        "line_end": "2181.5",
        "line_text": "And that was the original design for GPUs, but it turns out that this sort of parallel processing sort of GPU design\n"
    },
    {
        "line_start": "2181.5",
        "line_end": "2188.5",
        "line_text": "is good for a bunch of other problems as well, for example, Bitcoin mining or training machine learning algorithms.\n"
    },
    {
        "line_start": "2188.5",
        "line_end": "2197.5",
        "line_text": "And GPUs, even though they have this sort of specialized digital design, they still use the stored program model.\n"
    },
    {
        "line_start": "2197.5",
        "line_end": "2207.5",
        "line_text": "So you can still write different programs to load GPU memory with different types of data, ask the processors to perform different types of operations on that data,\n"
    },
    {
        "line_start": "2207.5",
        "line_end": "2212.5",
        "line_text": "that aren't necessarily graphics-related.\n"
    },
    {
        "line_start": "2212.5",
        "line_end": "2218.5",
        "line_text": "And so another example are DSPs or digital signal processors.\n"
    },
    {
        "line_start": "2218.5",
        "line_end": "2235.5",
        "line_text": "So DSP chips, again, have a bunch of kind of specialized digital designs or cores within the chip that are meant to accelerate things like free transforms or filtering operations,\n"
    },
    {
        "line_start": "2235.5",
        "line_end": "2238.5",
        "line_text": "but they still use the stored program model.\n"
    },
    {
        "line_start": "2238.5",
        "line_end": "2246.5",
        "line_text": "So you still write a program for these things, and the program determines what data is fed into this special digital design,\n"
    },
    {
        "line_start": "2246.5",
        "line_end": "2251.5",
        "line_text": "and to a certain extent what operations are performed on the data.\n"
    },
    {
        "line_start": "2251.5",
        "line_end": "2256.5",
        "line_text": "Now, finally, I also wanted to talk about the terms embedded design and firmware.\n"
    },
    {
        "line_start": "2256.5",
        "line_end": "2266.5",
        "line_text": "And because in many ways, what we're going to be learning in our hands on, in the hands-on part of this course, could be thought of as embedded design.\n"
    },
    {
        "line_start": "2266.5",
        "line_end": "2279.5",
        "line_text": "So an embedded system to start out with, an embedded system is a computer that is embedded into a sort of larger design that does a very specific job.\n"
    },
    {
        "line_start": "2279.5",
        "line_end": "2296.5",
        "line_text": "So it still is a computer, it uses the stored program model, it's a generalized computing device where we could change what it does based on just sort of changing the program.\n"
    },
    {
        "line_start": "2296.5",
        "line_end": "2307.5",
        "line_text": "However, we then take that computer, and typically these are microcontrollers, we then take that microcontroller and put it in a design that really kind of constrains what we can do with it.\n"
    },
    {
        "line_start": "2307.5",
        "line_end": "2314.5",
        "line_text": "So a great example is the microcontrollers that are embedded in automobiles.\n"
    },
    {
        "line_start": "2314.5",
        "line_end": "2318.5",
        "line_text": "And so microcontrollers are put in automobiles.\n"
    },
    {
        "line_start": "2318.5",
        "line_end": "2322.5",
        "line_text": "These microcontrollers, again in theory, could be programmed to do anything at all.\n"
    },
    {
        "line_start": "2322.5",
        "line_end": "2334.5",
        "line_text": "But then we put them inside an engine, and we connect the microcontroller to fuel injector controllers and sensors in the car.\n"
    },
    {
        "line_start": "2334.5",
        "line_end": "2346.5",
        "line_text": "And so while in theory we could reprogram that microcontroller to do something that isn't car related, it doesn't really make sense because the thing is literally buried into a car and it's only connected to automobile parts.\n"
    },
    {
        "line_start": "2346.5",
        "line_end": "2357.5",
        "line_text": "And so that's what we refer to as an embedded design, and the software that we write for these embedded devices we refer to as firmware.\n"
    },
    {
        "line_start": "2357.5",
        "line_end": "2366.5",
        "line_text": "And firmware is typically software that's written for very sort of low level microcontroller type devices.\n"
    },
    {
        "line_start": "2366.5",
        "line_end": "2378.5",
        "line_text": "And the reason why we call it firm rather than soft is because it is possible to change it, but it's not as easy to change it as it is to change a program running on a laptop, for example.\n"
    },
    {
        "line_start": "2378.5",
        "line_end": "2389.5",
        "line_text": "And this is because in an embedded design again, these computers are placed into a very sort of specialized design.\n"
    },
    {
        "line_start": "2389.5",
        "line_end": "2403.5",
        "line_text": "We can change the software running on the devices, but there's a lot of constraints based on the fact that this thing exists in a very sort of specific type design application.\n"
    },
    {
        "line_start": "2404.5",
        "line_end": "2428.5",
        "line_text": "Microcontrollers are typically the devices that are used for embedded design, and so the programming that we're going to be doing in this class could be seen or is seen by many or would be considered by many as firmware development rather than software development, even though we are going to be writing all our programs and see which you can use for just regular software as well.\n"
    },
    {
        "line_start": "2428.5",
        "line_end": "2436.5",
        "line_text": "So just to wrap up to reiterate, our goal is basically to learn how a computer works in air quotes, right?\n"
    },
    {
        "line_start": "2436.5",
        "line_end": "2443.5",
        "line_text": "And again, a lot of people think they know how a computer works, but typically don't sort of go to the level that we're going to be discussing in this class.\n"
    },
    {
        "line_start": "2443.5",
        "line_end": "2457.5",
        "line_text": "And by, you know, if I were to define for the purposes of this class, understanding how a computer works, it basically means we are going to learn how to take a high level programming language,\n"
    },
    {
        "line_start": "2457.5",
        "line_end": "2466.5",
        "line_text": "like see and convert it or translate it down into low level binary machine language instructions that a micro architecture can understand.\n"
    },
    {
        "line_start": "2466.5",
        "line_end": "2468.5",
        "line_text": "So that'll be the first step.\n"
    },
    {
        "line_start": "2468.5",
        "line_end": "2480.5",
        "line_text": "And then we are going to talk about how to design the digital logic structures that are going to execute these low level machine language instructions.\n"
    },
    {
        "line_start": "2480.5",
        "line_end": "2488.5",
        "line_text": "And finally, we're going to talk a little bit about how a micro architecture design can be enhanced to improve performance.\n"
    },
    {
        "line_start": "2488.5",
        "line_end": "2498.5",
        "line_text": "So much of this course is going to be designing a very basic micro architecture that can run machine language, but does it in a relatively inefficient way.\n"
    },
    {
        "line_start": "2498.5",
        "line_end": "2513.5",
        "line_text": "And then we're going to be the we're going to talk about things like caching and pipelining, and which are things that are done by most modern micro processors and micro controllers in order to speed things up or improve performance.\n"
    },
    {
        "line_start": "2513.5",
        "line_end": "2526.5",
        "line_text": "And by the end of this course, we will have bridge the gap between, you know, the high level program and the basic digital logic gates that you would have learned about in a previous course.\n"
    },
    {
        "line_start": "2526.5",
        "line_end": "2536.5",
        "line_text": "So that's why I'm really excited about this class. I really think that that's that's a cool thing to or that's a really cool space to work in, right.\n"
    },
    {
        "line_start": "2536.5",
        "line_end": "2543.5",
        "line_text": "So finally, we get to connect those last two dots you've learned how to program you've learned what logic gates are all about.\n"
    },
    {
        "line_start": "2543.5",
        "line_end": "2549.5",
        "line_text": "Now let's join the two together and build a computer."
    }
]